ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/msp/mspm33c321x/UC4_I2CC_1.0.xml
        </group>
    <group id="UC4_I2CC_DMA_TRIG0" name="UC4_I2CC_DMA_TRIG0" instances="1" offset="0x1080" instaddr="0x30" description="">
        <register id="UC4_I2CC_DMA_TRIG0_IMASK" width="32" offset="0x8" description="Interrupt mask">
            <bitfield id="TXTRG" description="Transmit Trigger" begin="3" end="3" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
        </register>
        <register id="UC4_I2CC_DMA_TRIG0_RIS" width="32" offset="0x10" description="Raw interrupt status">
            <bitfield id="TXTRG" description="Transmit Trigger" begin="3" end="3" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
        </register>
        <register id="UC4_I2CC_DMA_TRIG0_MIS" width="32" offset="0x18" description="Masked interrupt status">
            <bitfield id="TXTRG" description="Transmit Trigger" begin="3" end="3" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
        </register>
        <register id="UC4_I2CC_DMA_TRIG0_ISET" width="32" offset="0x20" description="Interrupt set">
            <bitfield id="TXTRG" description="Transmit Trigger" begin="3" end="3" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
        </register>
        </group>
    <register id="UC4_I2CC_INTCTL" width="32" offset="0x10E4" description="Interrupt control register">
        <bitfield id="INTEVAL" description="Writing a 1 to this field re-evaluates the interrupt sources." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="The interrupt or event line is disabled."/>
            <bitenum id="EVAL" value="0x1" description="The interrupt or event line is in software mode. Software must clear the RIS."/>
        </bitfield>
    </register>
    <register id="UC4_I2CC_CTR" width="32" offset="0x1100" description="Control Register">
        <bitfield id="FRM_START" description="Start Transfer" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="In standard mode, this encoding means the Controller is unable to transmit or receive data."/>
            <bitenum id="ENABLE" value="0x1" description="The Controller is able to transmit or receive data. See field decoding in Table: MCTR Field decoding."/>
        </bitfield>
        <bitfield id="START" description="Generate START" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="The controller does not generate the START condition."/>
            <bitenum id="ENABLE" value="0x1" description="The controller generates the START or repeated START condition. See field decoding in Table: MCTR Field decoding."/>
        </bitfield>
        <bitfield id="STOP" description="Generate STOP" begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="The controller does not generate the STOP condition."/>
            <bitenum id="ENABLE" value="0x1" description="The controller generates the STOP condition. See field decoding in Table: MCTR Field decoding."/>
        </bitfield>
        <bitfield id="ACK" description="Data Acknowledge Enable.
Software needs to configure this bit to send the ACK or NACK.
See field decoding in Table: MCTR Field decoding." begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="The last received data byte of a transaction is not acknowledged automatically ."/>
            <bitenum id="ENABLE" value="0x1" description="The last received data byte of a transaction is acknowledged automatically ."/>
        </bitfield>
        <bitfield id="BLEN" description="I2C transaction length
This field contains the programmed length of bytes of the Transaction." begin="27" end="16" width="12" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xFFF" description="Highest possible value"/>
        </bitfield>
        <bitfield id="ACKOEN" description="ACK overrride Enable" begin="4" end="4" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="No special behavior"/>
            <bitenum id="ENABLE" value="0x1" description="When 1 and the Controller is receiving data and the number of bytes indicated in MBLEN have been received, the state machine will generate an rxdone interrupt and wait at the start of the ACK for FW to indicate if an ACK or NACK should be sent. The ACK or NACK is selected by writing the MCTR register and setting ACK accordingly. The other fields in this register can also be written at this time to continue on with the transaction. If a NACK is sent the state machine will automatically send a Stop."/>
        </bitfield>
        <bitfield id="RD_ON_TXEMPTY" description="Read on TX Empty" begin="5" end="5" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="No special behavior"/>
            <bitenum id="ENABLE" value="0x1" description="When 1 the Controller will transmit all bytes from the TX FIFO before continuing with the programmed Burst Run Read. If the DIR is not set to Read in the MSA then this bit is ignored. The Start must be set in the MCTR for proper I2C protocol. The Controller will first send the Start Condition, I2C Address with R/W bit set to write, before sending the bytes in the TX FIFO. When the TX FIFO is empty, the I2C transaction will continue as programmed in MTCR and MSA without sending a Stop Condition.
This is intended to be used to perform simple I2C command based reads transition that will complete after initiating them without having to get an interrupt to turn the bus around."/>
        </bitfield>
        <bitfield id="SUSPEND" description="Suspend external communication" begin="6" end="6" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Functional mode resumed"/>
            <bitenum id="ENABLE" value="0x1" description="External communication suspended"/>
        </bitfield>
    </register>
    <register id="UC4_I2CC_CR" width="32" offset="0x1104" description="Configuration">
        <bitfield id="MCTL" description="MultiController mode. In MultiController mode the SCL high time counts once the SCL line has been detected high. If this is not enabled the high time counts as soon as the SCL line has been set high by the I2C controller." begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Disable MultiController mode."/>
            <bitenum id="ENABLE" value="0x1" description="Enable MultiController mode."/>
        </bitfield>
        <bitfield id="ENABLE" description="Enable module.  After this bit has been set, it should not be set again unless it has been cleared by writing a 0 or by a reset, otherwise transfer failures may occur." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Disables operation."/>
            <bitenum id="ENABLE" value="0x1" description="Enables operation."/>
        </bitfield>
        <bitfield id="CLKSTRETCH" description="Clock Stretching. This bit controls the support for clock stretching of the I2C bus." begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Disables the clock stretching detection.
This can be disabled if no Target on the bus does support clock stretching, so that the maximum speed on the bus can be reached."/>
            <bitenum id="ENABLE" value="0x1" description="Enables the clock stretching detection.
Enabling the clock stretching ensures compliance to the I2C standard but could limit the speed due the clock stretching."/>
        </bitfield>
    </register>
    <register id="UC4_I2CC_SR" width="32" offset="0x1108" description="Status Register">
        <bitfield id="BUSY" description="FSM Busy
The BUSY bit is set during an ongoing transaction, so is set during the transmit/receive of the amount of data set in MBLEN including START, RESTART, Address and STOP signal generation when required for the current transaction." begin="0" end="0" width="1" rwaccess="R">
            <bitenum id="CLEARED" value="0x0" description="The controller is idle."/>
            <bitenum id="SET" value="0x1" description="The controller is busy."/>
        </bitfield>
        <bitfield id="ERR" description="Error 
The error can be from the Target address not being acknowledged or the transmit data not being acknowledged." begin="1" end="1" width="1" rwaccess="R">
            <bitenum id="CLEARED" value="0x0" description="No error was detected on the last operation."/>
            <bitenum id="SET" value="0x1" description="An error occurred on the last operation."/>
        </bitfield>
        <bitfield id="ADRACK" description="Acknowledge Address" begin="2" end="2" width="1" rwaccess="R">
            <bitenum id="CLEARED" value="0x0" description="The transmitted address was acknowledged"/>
            <bitenum id="SET" value="0x1" description="The transmitted address was not acknowledged."/>
        </bitfield>
        <bitfield id="DATACK" description="Acknowledge Data" begin="3" end="3" width="1" rwaccess="R">
            <bitenum id="CLEARED" value="0x0" description="The transmitted data was acknowledged"/>
            <bitenum id="SET" value="0x1" description="The transmitted data was not acknowledged."/>
        </bitfield>
        <bitfield id="ARBLST" description="Arbitration Lost" begin="4" end="4" width="1" rwaccess="R">
            <bitenum id="CLEARED" value="0x0" description="The I2C controller won arbitration."/>
            <bitenum id="SET" value="0x1" description="The I2C controller lost arbitration."/>
        </bitfield>
        <bitfield id="IDLE" description="I2C Idle" begin="5" end="5" width="1" rwaccess="R">
            <bitenum id="CLEARED" value="0x0" description="The I2C controller is not idle."/>
            <bitenum id="SET" value="0x1" description="The I2C controller is idle."/>
        </bitfield>
        <bitfield id="BUSBSY" description="I2C Bus is Busy
Controller State Machine will wait until this bit to be cleared before starting a transaction. When first enabling the Controller in multi Controller environments, FW should wait for one I2C clock period after setting ACTIVE high before writing to the CTR register to start the transaction so that if SCL goes low it will trigger the BUSBSY." begin="6" end="6" width="1" rwaccess="R">
            <bitenum id="CLEARED" value="0x0" description="The I2C bus is idle."/>
            <bitenum id="SET" value="0x1" description="'This Status bit is set on a START or when SCL goes low. It is cleared on a STOP,  or when a SCL high bus busy timeout occurs and SCL and SDA are both high. This status is cleared when the ACTIVE bit is low.
Note that the Controller State Machine will wait until this bit is cleared before starting an I2C transaction. When first enabling the Controller in multi Controller environments, FW should wait for one I2C clock period after setting ACTIVE high before writing to the MTCR register to start the transaction so that if SCL goes low it will trigger the BUSBSY."/>
        </bitfield>
        <bitfield id="BCNT" description="Transaction Count
This field contains the current count-down value of the transaction." begin="27" end="16" width="12" rwaccess="R">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xFFF" description="Highest possible value"/>
        </bitfield>
        <bitfield id="RXCLR" description="RX FIFO Clear Status" begin="9" end="9" width="1" rwaccess="R">
            <bitenum id="CLEARED" value="0x0" description="FIFO is not cleared"/>
            <bitenum id="SET" value="0x1" description="FIFO clear is complete"/>
        </bitfield>
        <bitfield id="TXCLR" description="TX FIFO Clear Status" begin="10" end="10" width="1" rwaccess="R">
            <bitenum id="CLEARED" value="0x0" description="FIFO is not cleared"/>
            <bitenum id="SET" value="0x1" description="FIFO clear is complete"/>
        </bitfield>
        <bitfield id="RXFE" description="Receive FIFO Empty  The meaning of this bit depends on the state of the FEN bit in the CTL0 register." begin="11" end="11" width="1" rwaccess="R">
            <bitenum id="CLEARED" value="0x0" description="The receiver is not empty."/>
            <bitenum id="SET" value="0x1" description="If the FIFO is disabled (FEN is 0), the receive holding register is empty. If the FIFO is enabled (FEN is 1), the receive FIFO is empty."/>
        </bitfield>
        <bitfield id="RXFF" description="Receive FIFO Full  The meaning of this bit depends on the state of the FEN bit in the CTL0 register." begin="12" end="12" width="1" rwaccess="R">
            <bitenum id="CLEARED" value="0x0" description="The receiver can receive data."/>
            <bitenum id="SET" value="0x1" description="If the FIFO is disabled (FEN is 0), the receive holding register is full. If the FIFO is enabled (FEN is 1), the receive FIFO is full."/>
        </bitfield>
        <bitfield id="TXFE" description="Transmit FIFO Empty  The meaning of this bit depends on the state of the FEN bit in the CTL0 register." begin="13" end="13" width="1" rwaccess="R">
            <bitenum id="CLEARED" value="0x0" description="The transmitter has data to transmit."/>
            <bitenum id="SET" value="0x1" description="If the FIFO is disabled (FEN is 0), the transmit holding register is empty. If the FIFO is enabled (FEN is 1), the transmit FIFO is empty."/>
        </bitfield>
        <bitfield id="TXFF" description="Transmit FIFO Full  The meaning of this bit depends on the state of the FEN bit in the CTL0 register." begin="14" end="14" width="1" rwaccess="R">
            <bitenum id="CLEARED" value="0x0" description="The transmitter is not full."/>
            <bitenum id="SET" value="0x1" description="If the FIFO is disabled (FEN is 0), the transmit holding register is full. If the FIFO is enabled (FEN is 1), the transmit FIFO is full."/>
        </bitfield>
    </register>
    <register id="UC4_I2CC_IFLS" width="32" offset="0x110C" description="Interrupt FIFO Level Select Register">
        <bitfield id="TXIFLSEL" description="FIFO Level Select for generating events (interrupt/dma). 
Note: for undefined settings the default configuration is used." begin="2" end="0" width="3" rwaccess="R/W">
            <bitenum id="LVL_3_4" value="0x1" description="TX FIFO &lt;= 3/4 empty"/>
            <bitenum id="LVL_1_2" value="0x2" description="TX FIFO &lt;= 1/2 empty (default)"/>
            <bitenum id="LVL_1_4" value="0x3" description="TX FIFO &lt;= 1/4 empty"/>
            <bitenum id="LVL_NOT_FULL" value="0x4" description="Opposite of full"/>
            <bitenum id="LVL_EMPTY" value="0x5" description="TX FIFO is empty"/>
            <bitenum id="LVL_ALMOST_EMPTY" value="0x6" description="TX FIFO &lt;= 1"/>
            <bitenum id="LVL_ALMOST_FULL" value="0x7" description="TX_FIFO &gt;= (MAX_FIFO_LEN -1)"/>
        </bitfield>
        <bitfield id="RXIFLSEL" description="FIFO Level Select for generating events (interrupt/dma). 
Note: for undefined settings the default configuration is used." begin="6" end="4" width="3" rwaccess="R/W">
            <bitenum id="LVL_1_4" value="0x1" description="RX FIFO &gt;= 1/4 full"/>
            <bitenum id="LVL_1_2" value="0x2" description="RX FIFO &gt;= 1/2 full (default)"/>
            <bitenum id="LVL_3_4" value="0x3" description="RX FIFO &gt;= 3/4 full"/>
            <bitenum id="LVL_NOT_EMPTY" value="0x4" description="Opposite of empty"/>
            <bitenum id="LVL_FULL" value="0x5" description="RX FIFO is full"/>
            <bitenum id="LVL_ALMOST_FULL" value="0x6" description="RX_FIFO &gt;= (MAX_FIFO_LEN -1)"/>
            <bitenum id="LVL_ALMOST_EMPTY" value="0x7" description="RX_FIFO &lt;= 1"/>
        </bitfield>
        <bitfield id="TXCLR" description="TX FIFO CLEAR. Setting this bit will clear the TX FIFO contents." begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Disable FIFO clear"/>
            <bitenum id="ENABLE" value="0x1" description="Enable FIFO Clear"/>
        </bitfield>
        <bitfield id="RXCLR" description="RX FIFO CLEAR. Setting this bit will clear the RX FIFO contents." begin="7" end="7" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Disable FIFO clear"/>
            <bitenum id="ENABLE" value="0x1" description="Enable FIFO Clear"/>
        </bitfield>
    </register>
    <register id="UC4_I2CC_TPR" width="32" offset="0x1110" description="Timer Period">
        <bitfield id="TPR" description="Timer Period 
This field is used in the equation to configure SCL_PERIOD :
SCL_PERIOD = (1 + TPR ) * (SCL_LP + SCL_HP ) * INT_CLK_PRD
where: 
  SCL_PRD is the SCL line period (I2C clock).
  TPR is the Timer Period register value (range of 1 to 127).
  SCL_LP is the SCL Low period (fixed at 6).
  SCL_HP is the SCL High period (fixed at 4).
  CLK_PRD is the functional clock period in ns." begin="6" end="0" width="7" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0x7F" description="Highest possible value"/>
        </bitfield>
    </register>
    <register id="UC4_I2CC_GFCTL" width="32" offset="0x1118" description="I2C Glitch Filter Control">
        <bitfield id="AGFEN" description="Analog Glitch Suppression Enable" begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Analog Glitch Filter disable"/>
            <bitenum id="ENABLE" value="0x1" description="Analog Glitch Filter enable"/>
        </bitfield>
    </register>
    <register id="UC4_I2CC_BMON" width="32" offset="0x111C" description="Bus Monitor">
        <bitfield id="SCL" description="I2C SCL Status" begin="0" end="0" width="1" rwaccess="R">
            <bitenum id="CLEARED" value="0x0" description="The I2CSCL signal is low."/>
            <bitenum id="SET" value="0x1" description="The I2CSCL signal is high. Note: During and right after reset, the SCL pin is in GPIO input mode without the internal pull enabled. For proper I2C operation, the user should have the external pull-up resistor in place before starting any I2C operations."/>
        </bitfield>
        <bitfield id="SDA" description="I2C SDA Status" begin="1" end="1" width="1" rwaccess="R">
            <bitenum id="CLEARED" value="0x0" description="The I2CSDA signal is low."/>
            <bitenum id="SET" value="0x1" description="The I2CSDA signal is high. Note: During and right after reset, the SDA pin is in GPIO input mode without the internal pull enabled. For proper I2C operation, the user should have the external pull-up resistor in place before starting any I2C operations."/>
        </bitfield>
    </register>
    <register id="UC4_I2CC_TXDATA" width="32" offset="0x1120" description="TXData">
        <bitfield id="DATA" description="Transmit Data
This byte contains the data to be transferred during the next transaction." begin="7" end="0" width="8" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xFF" description="Highest possible value"/>
        </bitfield>
    </register>
    <register id="UC4_I2CC_RXDATA" width="32" offset="0x1124" description="RXData">
        <bitfield id="DATA" description="Received Data. 
This field contains the last received data." begin="7" end="0" width="8" rwaccess="R">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xFF" description="Highest possible value"/>
        </bitfield>
    </register>
    <register id="UC4_I2CC_PECSR" width="32" offset="0x1128" description="PEC status register">
        <bitfield id="PECBYTECNT" description="PEC Byte Count	
This is the current PEC Byte Count of the Controller State Machine." begin="8" end="0" width="9" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Minimum Value"/>
            <bitenum id="MAXIMUM" value="0x1FF" description="Maximum Value"/>
        </bitfield>
        <bitfield id="PECSTS_CHECK" description="This status bit indicates if the PEC was checked in the transaction that occurred before the last Stop. Latched on Stop." begin="16" end="16" width="1" rwaccess="R/W">
            <bitenum id="CLEARED" value="0x0" description="Indicates PEC was not checked in the transaction that occurred before the last Stop"/>
            <bitenum id="SET" value="0x1" description="Indicates if the PEC was checked in the transaction that occurred before the last Stop"/>
        </bitfield>
        <bitfield id="PECSTS_ERROR" description="This status bit indicates if a PEC check error occurred in the transaction that occurred before the last Stop. Latched on Stop." begin="17" end="17" width="1" rwaccess="R/W">
            <bitenum id="CLEARED" value="0x0" description="Indicates PEC check error did not occurr in the transaction that occurred before the last Stop"/>
            <bitenum id="SET" value="0x1" description="Indicates if a PEC check error occurred in the transaction that occurred before the last Stop"/>
        </bitfield>
    </register>
    <register id="UC4_I2CC_TA" width="32" offset="0x114C" description="Target Address Register">
        <bitfield id="DIR" description="Receive/Send
The DIR bit specifies if the next operation is a Receive (High) or Transmit (Low).
0h = Transmit
1h = Receive" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="TRANSMIT" value="0x0" description="in transmit mode."/>
            <bitenum id="RECEIVE" value="0x1" description="is in receive mode."/>
        </bitfield>
        <bitfield id="ADDR" description="I2C Target Address This field specifies bits A9 through A0 of the Target address.
In 7-bit addressing mode as selected by MSA.MODE bit, the top 3 bits are don't care" begin="10" end="1" width="10" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0x3FF" description="Highest possible value"/>
        </bitfield>
        <bitfield id="MODE" description="This bit selects the adressing mode to be used 
When 0, 7-bit addressing is used.
When 1, 10-bit addressing is used." begin="15" end="15" width="1" rwaccess="R/W">
            <bitenum id="MODE7" value="0x0" description="7-bit addressing mode"/>
            <bitenum id="MODE10" value="0x1" description="10-bit addressing mode"/>
        </bitfield>
    </register>
